In [4]:
import numpy as np
import pandas as pd

In [16]:
df_5 = pd.read_csv('AirPassengers.csv')

# ----------------------------------------------------------------------------------------------------------------------------

In [5]:
df_5 = pd.read_csv('AirPassengers.csv')

In [6]:
df_5.describe()

       #Passengers
count   144.000000
mean    280.298611
std     119.966317
min     104.000000
25%     180.000000
50%     265.500000
75%     360.500000
max     622.000000

In [ ]:
df.isnull().sum()

# ----------------------------------------------------------------------------------------------------------------------------

In [101]:
dfObj = pd.DataFrame(students, columns = ['Name' , 'Age', 'City' , 'Country'], index=['a', 'b', 'c' , 'd' , 'e' , 'f'])

In [100]:
students = [ ('jack', 34, 'Sydeny' , 'Australia') ,
             ('Riti', 30, 'Delhi' , 'India' ) ,
             ('Vikas', 31, 'Mumbai' , 'India' ) ,
             ('Neelu', 32, 'Bangalore' , 'India' ) ,
             ('John', 16, 'New York' , 'US') ,
             ('Mike', 17, 'las vegas' , 'US')  ]

In [102]:
df_8 = dfObj

In [69]:
dfObj = df_9

NameError: name 'df_9' is not defined

In [67]:
dfObj = df_8

NameError: name 'df_8' is not defined

In [17]:
df

       NAME  AGE  HEIGHT
nome1    Su   12    1.80
nome2   Tha   45    1.85
nome3   Yan   23    1.56
nome4   Han   35    1.75
nome5  Zhan   30    1.79

In [2]:
# infra = pd.read_csv('qwe.txt', delimiter='\t', names=['n_ondas','transm'])

In [9]:
np = {'NAME':['Su','Tha','Yan','Han','Zhan'], 'AGE':[12,45,23,35,30],'HEIGHT':[1.80,1.85,1.56,1.75,1.79]}

In [10]:
np

{'NAME': ['Su', 'Tha', 'Yan', 'Han', 'Zhan'],
 'AGE': [12, 45, 23, 35, 30],
 'HEIGHT': [1.8, 1.85, 1.56, 1.75, 1.79]}

In [11]:
df = pd.DataFrame(np,index=['nome1','nome2','nome3','nome4','nome5'], columns =['height1','height2','height3'])

In [12]:
df

      height1 height2 height3
nome1     NaN     NaN     NaN
nome2     NaN     NaN     NaN
nome3     NaN     NaN     NaN
nome4     NaN     NaN     NaN
nome5     NaN     NaN     NaN

In [7]:
df['height1']

nome1    NaN
nome2    NaN
nome3    NaN
nome4    NaN
nome5    NaN
Name: height1, dtype: object

In [13]:
np = {'NAME':['Su','Tha','Yan','Han','Zhan'], 'AGE':[12,45,23,35,30],'HEIGHT':[1.80,1.85,1.56,1.75,1.79]}

In [14]:
np

{'NAME': ['Su', 'Tha', 'Yan', 'Han', 'Zhan'],
 'AGE': [12, 45, 23, 35, 30],
 'HEIGHT': [1.8, 1.85, 1.56, 1.75, 1.79]}

In [15]:
df = pd.DataFrame(np,index=['nome1','nome2','nome3','nome4','nome5'], columns =['NAME','AGE','HEIGHT'])

In [16]:
df

       NAME  AGE  HEIGHT
nome1    Su   12    1.80
nome2   Tha   45    1.85
nome3   Yan   23    1.56
nome4   Han   35    1.75
nome5  Zhan   30    1.79

In [10]:
df['NAME']

nome1      Su
nome2     Tha
nome3     Yan
nome4     Han
nome5    Zhan
Name: NAME, dtype: object

In [ ]:
# DIFFERENCES BETWEEN SERIES AND DATAFRAME

In [14]:
df['NAME'].append(pd.Series('oi'))

nome1      Su
nome2     Tha
nome3     Yan
nome4     Han
nome5    Zhan
0          oi
dtype: object

In [14]:
df.head(2)

      NAME  AGE  HEIGHT
nome1   Su   12    1.80
nome2  Tha   45    1.85

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, nome1 to nome5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   NAME    5 non-null      object
 1   AGE     5 non-null      int64
 2   HEIGHT  5 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 160.0+ bytes

In [35]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
infra['transm'].dtype

In [ ]:
df.dtype()

---------------------------------------------------------------------------
AttributeError                            Traceback (most recent call last)
<ipython-input-39-144c7b0decef> in <module>
----> 1 df.dtype()

~\anaconda3\lib\site-packages\pandas\core\generic.py in __getattr__(self, name)
   5272             if self._info_axis._can_hold_identifiers_and_holds_name(name):
   5273                 return self[name]
-> 5274             return object.__getattribute__(self, name)
   5275 
   5276     def __setattr__(self, name: str, value) -> None:

AttributeError: 'DataFrame' object has no attribute 'dtype'

In [69]:
print(df.shape)

(5, 3)

In [41]:
df['AGE'].mean()

29.0

In [42]:
df['AGE'].max()

45

In [43]:
df['AGE'].min()

12

In [44]:
df['AGE']

nome1    12
nome2    45
nome3    23
nome4    35
nome5    30
Name: AGE, dtype: int64

In [45]:
df['AGE'] == 12

nome1     True
nome2    False
nome3    False
nome4    False
nome5    False
Name: AGE, dtype: bool

In [46]:
df[df['AGE'] == 12]

      NAME  AGE  HEIGHT
nome1   Su   12     1.8

In [47]:
df[df['AGE'] == 12] ['NAME']

nome1    Su
Name: NAME, dtype: object

In [48]:
df['AGE'] == df['AGE'].max()

nome1    False
nome2     True
nome3    False
nome4    False
nome5    False
Name: AGE, dtype: bool

In [49]:
df[df['AGE'] == df['AGE'].max()]

      NAME  AGE  HEIGHT
nome2  Tha   45    1.85

In [58]:
df[df['AGE'] == df['AGE'].min()]

      NAME  AGE  HEIGHT
nome1   Su   12     1.8

In [50]:
df[df['AGE'] == df['AGE'].max()]['NAME']

nome2    Tha
Name: NAME, dtype: object

In [52]:
df.loc[df['AGE'].idxmax()]

NAME       Tha
AGE         45
HEIGHT    1.85
Name: nome2, dtype: object

In [53]:
df['AGE'].idxmax()

'nome2'

In [57]:
df['AGE'].argmin()

0

In [55]:
df.iloc[df['AGE'].argmax()]

NAME       Tha
AGE         45
HEIGHT    1.85
Name: nome2, dtype: object

In [56]:
df.iloc[df['AGE'].argmin()]

NAME       Su
AGE        12
HEIGHT    1.8
Name: nome1, dtype: object

In [54]:
df['AGE'].idxmax()

'nome2'

In [59]:
df.groupby('HEIGHT').mean()

        AGE
HEIGHT
1.56     23
1.75     35
1.79     30
1.80     12
1.85     45

In [61]:
df.groupby('HEIGHT').mean()['AGE']

HEIGHT
1.56    23
1.75    35
1.79    30
1.80    12
1.85    45
Name: AGE, dtype: int64

In [62]:
df['HEIGHT'].unique()

array([1.8 , 1.85, 1.56, 1.75, 1.79])

In [63]:
df['HEIGHT'].nunique()

5

In [64]:
df['HEIGHT'].value_counts().head(3)

1.56    1
1.85    1
1.80    1
Name: HEIGHT, dtype: int64

In [ ]:
#sal[sal['Year']==2013]['JobTitle'].value_counts()
#sum(sal[sal['Year']==2013]['JobTitle'].value_counts() == 1)

In [66]:
df

       NAME  AGE  HEIGHT
nome1    Su   12    1.80
nome2   Tha   45    1.85
nome3   Yan   23    1.56
nome4   Han   35    1.75
nome5  Zhan   30    1.79

In [65]:
df['AGE']

nome1    12
nome2    45
nome3    23
nome4    35
nome5    30
Name: AGE, dtype: int64

In [67]:
df[df['AGE'] > 23]

       NAME  AGE  HEIGHT
nome2   Tha   45    1.85
nome4   Han   35    1.75
nome5  Zhan   30    1.79

In [68]:
df[df['AGE'] > 23].count()

NAME      3
AGE       3
HEIGHT    3
dtype: int64

In [70]:
df['AGE'].tolist()

[12, 45, 23, 35, 30]

In [71]:
df['AGE'].to_numpy()

array([12, 45, 23, 35, 30], dtype=int64)

In [72]:
df.filter(['AGE'])

       AGE
nome1   12
nome2   45
nome3   23
nome4   35
nome5   30

In [16]:
df

       NAME  AGE  HEIGHT
nome1    Su   12    1.80
nome2   Tha   45    1.85
nome3   Yan   23    1.56
nome4   Han   35    1.75
nome5  Zhan   30    1.79

In [17]:
def name(title):
    if 'pop' in title.lower().split():
        return True
    else:
        return False

In [18]:
print(name)

<function name at 0x00000226BD1AD288>

In [ ]:
dataList = bad['residual sugar']
for row in df.itertuples(): 
    mylist = [row.cluster, row.load_date, row.budget, row.actual, row.fixed_price]
    dataList.append(mylist)

In [ ]:
dataList = [] #empty list
for row in df.itertuples(): 
    mylist = [row.cluster, row.load_date, row.budget, row.actual, row.fixed_price]
    dataList.append(mylist)

In [6]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [11]:
pd.Series()

Series([], dtype: float64)

In [12]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [14]:
pd.Series(data = my_data,index=labels) #pd.Series(data = my_data,labels)

a    10
b    20
c    30
dtype: int64

In [15]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [16]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [17]:
d

{'a': 10, 'b': 20, 'c': 30}

In [18]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [20]:
series1 = pd.Series([1,2,3,4],['usa','german','ussr','japan'])

In [21]:
series1

usa       1
german    2
ussr      3
japan     4
dtype: int64

In [24]:
a = {1:'usa',2:'german',3:'ussr',4:'japan'}

In [25]:
pd.Series2(a) ?????

AttributeError: module 'pandas' has no attribute 'Series2'

In [26]:
ser1 = pd.Series([1,2,3,4],['usa','german','ussr','japan'])

In [27]:
ser2 = pd.Series([1,2,3,4],['usa','german','italy','japan'])

In [28]:
ser3 = pd.Series(data=labels)

In [29]:
ser3

0    a
1    b
2    c
dtype: object

In [30]:
ser1 + ser2

german    4.0
italy     NaN
japan     8.0
usa       2.0
ussr      NaN
dtype: float64

# SAVING THE FILES

In [ ]:
df.to_csv('file1.csv')

# ---------------------------------------------------------------------------------------------------------------

# REPLACING METHODS

In [24]:
df_5['#Passengers'] = df_5['#Passengers'].astype(str).str.replace('1','W')

In [ ]:
df['a'].astype(str).str.replace("5", " hi ")

In [25]:
df_5

       Month #Passengers
0    1949-01         WW2
1    1949-02         WW8
2    1949-03         W32
3    1949-04         W29
4    1949-05         W2W
..       ...         ...
139  1960-08         606
140  1960-09         508
141  1960-10         46W
142  1960-11         390
143  1960-12         432

[144 rows x 2 columns]

In [17]:
df_5

       Month  #Passengers
0    1949-01          112
1    1949-02          118
2    1949-03          132
3    1949-04          129
4    1949-05          121
..       ...          ...
139  1960-08          606
140  1960-09          508
141  1960-10          461
142  1960-11          390
143  1960-12          432

[144 rows x 2 columns]

In [ ]:
def clean_currency(x):
    """ If the value is a string, then remove currency symbol and delimiters
    otherwise, the value is numeric and can be converted
    """
    if isinstance(x, str):
        return(x.replace('', ''))
    return(x)

df_5['Release Clause'] = df_5['Release Clause'].apply(clean_currency)

In [ ]:
df_5['Release Clause'].apply(clean_currency)

# ---------------------------------------------------------------------------------------------------------------

In [ ]:
def currency(frame):
    return frame > 90

df_0 = df_0['Composure'].apply(currency)

# ---------------------------------------------------------------------------------------------------------------

In [ ]:
>>> 'Hello world'.replace('world', 'Guido')
'Hello Guido'

In [13]:
x = isinstance(5, int)

print(x)

True

In [ ]:
def clean_currency(x):
    """ If the value is a string, then remove currency symbol and delimiters
    otherwise, the value is numeric and can be converted
    """ # se x for uma string
    if isinstance(x, str):
        return(x.replace('', '').replace(',', ''))
    return(x)

# ---------------------------------------------------------------------------------------------------------------

# SORT FRAME PANDAS DATAFRAME

In [10]:
import pandas as pd
 
cars = {'Brand': ['Honda Civic','Toyota Corolla','Ford Focus','Audi A4'],
        'Price': [22000,25000,27000,35000],
        'Year': [2015,2013,2018,2018]
        }
 
df = pd.DataFrame(cars, columns= ['Brand', 'Price','Year'])

print (df)

            Brand  Price  Year
0     Honda Civic  22000  2015
1  Toyota Corolla  25000  2013
2      Ford Focus  27000  2018
3         Audi A4  35000  2018

In [11]:
df.sort_values(by=['Brand'], inplace=True)
# ascending=False

In [12]:
df

            Brand  Price  Year
3         Audi A4  35000  2018
2      Ford Focus  27000  2018
0     Honda Civic  22000  2015
1  Toyota Corolla  25000  2013

# ---------------------------------------------------------------------------------------------------------------

# COLUMNS

In [14]:
df_5.columns

Index(['Month', '#Passengers'], dtype='object')

# ---------------------------------------------------------------------------------------------------------------

# RENAME METHODS

In [9]:
df_5 = pd.read_csv('AirPassengers.csv')

In [10]:
df_5

       Month  #Passengers
0    1949-01          112
1    1949-02          118
2    1949-03          132
3    1949-04          129
4    1949-05          121
..       ...          ...
139  1960-08          606
140  1960-09          508
141  1960-10          461
142  1960-11          390
143  1960-12          432

[144 rows x 2 columns]

In [12]:
df_6 =  df_5.rename(columns = {'#Passengers': 'Year'}, inplace = False)

In [14]:
df_6

       Month  Year
0    1949-01   112
1    1949-02   118
2    1949-03   132
3    1949-04   129
4    1949-05   121
..       ...   ...
139  1960-08   606
140  1960-09   508
141  1960-10   461
142  1960-11   390
143  1960-12   432

[144 rows x 2 columns]

# ----------------------------------------------------------------------------------------

In [8]:
df_5 = pd.read_csv('AirPassengers.csv')

In [29]:
df_5

       Month  #Passengers
0    1949-01          112
1    1949-02          118
2    1949-03          132
3    1949-04          129
4    1949-05          121
..       ...          ...
139  1960-08          606
140  1960-09          508
141  1960-10          461
142  1960-11          390
143  1960-12          432

[144 rows x 2 columns]

In [32]:
df_5.rename(columns = {'Month': 'Year', '#Passengers': 'Income'}, inplace = False)

        Year  Income
0    1949-01     112
1    1949-02     118
2    1949-03     132
3    1949-04     129
4    1949-05     121
..       ...     ...
139  1960-08     606
140  1960-09     508
141  1960-10     461
142  1960-11     390
143  1960-12     432

[144 rows x 2 columns]

# ---------------------------------------------------------------------------------------------------------------

In [49]:
# SEM INDEX

In [50]:
df_6 = pd.read_csv('AirPassengers.csv', index_col='Month')

In [51]:
df_6

         #Passengers
Month
1949-01          112
1949-02          118
1949-03          132
1949-04          129
1949-05          121
...              ...
1960-08          606
1960-09          508
1960-10          461
1960-11          390
1960-12          432

[144 rows x 1 columns]

# ---------------------------------------------------------------------------------------------------------------

In [87]:
df_7 = pd.read_csv('AirPassengers.csv', parse_dates=True)

In [54]:
df_7

       Month  #Passengers
0    1949-01          112
1    1949-02          118
2    1949-03          132
3    1949-04          129
4    1949-05          121
..       ...          ...
139  1960-08          606
140  1960-09          508
141  1960-10          461
142  1960-11          390
143  1960-12          432

[144 rows x 2 columns]

# ---------------------------------------------------------------------------------------------------------------

In [55]:
df_7.columns = ['month','thousand of passenger']

In [56]:
df_7

       month  thousand of passenger
0    1949-01                    112
1    1949-02                    118
2    1949-03                    132
3    1949-04                    129
4    1949-05                    121
..       ...                    ...
139  1960-08                    606
140  1960-09                    508
141  1960-10                    461
142  1960-11                    390
143  1960-12                    432

[144 rows x 2 columns]

# ---------------------------------------------------------------------------------------------------------------

In [57]:
df_7 = pd.read_csv('AirPassengers.csv', names = ['bar1','bar2'])

In [58]:
df_7

        bar1         bar2
0      Month  #Passengers
1    1949-01          112
2    1949-02          118
3    1949-03          132
4    1949-04          129
..       ...          ...
140  1960-08          606
141  1960-09          508
142  1960-10          461
143  1960-11          390
144  1960-12          432

[145 rows x 2 columns]

# DROP METHODS

In [71]:
df_8

# that`s just works when you have changed the axis

    Name  Age       City    Country
a   jack   34     Sydeny  Australia
b   Riti   30      Delhi      India
c  Vikas   31     Mumbai      India
d  Neelu   32  Bangalore      India
e   John   16   New York         US
f   Mike   17  las vegas         US

In [73]:
df_8.drop('b')

# that`s just works when you have changed the axis

    Name  Age       City    Country
a   jack   34     Sydeny  Australia
c  Vikas   31     Mumbai      India
d  Neelu   32  Bangalore      India
e   John   16   New York         US
f   Mike   17  las vegas         US

In [ ]:
df.drop('Unnamed: 0', axis=1)

In [ ]:
# # Multi drop()

df_0 = df.drop(['Club Logo','LS', 'ST','RS', 'LW', 'LF', 'CF', 'RF', 'RW', 'LAM', 'CAM', 'RAM', 'LM', 'LCM','CM', 
                'RCM', 'RM', 'LWB', 'LDM', 'CDM', 'RDM', 'RWB', 'LB', 'LCB', 'CB','RCB', 'RB'], axis=1)

df.drop(['Club Logo','LS', 'ST','RS', 'LW', 'LF', 'CF', 'RF', 'RW', 'LAM', 'CAM', 'RAM', 'LM', 'LCM','CM', 
                'RCM', 'RM', 'LWB', 'LDM', 'CDM', 'RDM', 'RWB', 'LB', 'LCB', 'CB','RCB', 'RB'], axis=1, inplace=True)

In [ ]:
df.dropna()

# drop all Nan Values

In [ ]:
# Multi drop()

df_0 = df.drop(['Unnamed: 0','Photo'], axis=1)

df.drop(['Unnamed: 0','Photo'], axis=1, inplace=True)

# ---------------------------------------------------------------------------------------------------------------

# RE-DEFINED INDEX AND SET INDEX

In [78]:
df_9

        bar1         bar2
0      Month  #Passengers
1    1949-01          112
2    1949-02          118
3    1949-03          132
5    1949-05          121
..       ...          ...
140  1960-08          606
141  1960-09          508
142  1960-10          461
143  1960-11          390
144  1960-12          432

[144 rows x 2 columns]

In [77]:
df_9 = df_7.drop(4)

In [86]:
df_9.sort_index(axis = 0)

        bar1         bar2
0      Month  #Passengers
1    1949-01          112
2    1949-02          118
3    1949-03          132
5    1949-05          121
..       ...          ...
140  1960-08          606
141  1960-09          508
142  1960-10          461
143  1960-11          390
144  1960-12          432

[144 rows x 2 columns]

# --------------------------------------------------------------------------------------------------------------

In [85]:
df_7

       Month  #Passengers
0    1949-01          112
1    1949-02          118
2    1949-03          132
3    1949-04          129
4    1949-05          121
..       ...          ...
139  1960-08          606
140  1960-09          508
141  1960-10          461
142  1960-11          390
143  1960-12          432

[144 rows x 2 columns]

In [84]:
df_7.set_index(["Month"])

         #Passengers
Month
1949-01          112
1949-02          118
1949-03          132
1949-04          129
1949-05          121
...              ...
1960-08          606
1960-09          508
1960-10          461
1960-11          390
1960-12          432

[144 rows x 1 columns]

# --------------------------------------------------------------------------------------------------------------

In [98]:
df_10 = pd.read_csv('AirPassengers.csv',index_col=["Month"])

In [99]:
df_10

         #Passengers
Month
1949-01          112
1949-02          118
1949-03          132
1949-04          129
1949-05          121
...              ...
1960-08          606
1960-09          508
1960-10          461
1960-11          390
1960-12          432

[144 rows x 1 columns]

# ---------------------------------------------------------------------------------------------------------------

# ILOC AND LOC

In [ ]:
# https://medium.com/horadecodar/data-science-tips-02-como-usar-loc-e-iloc-no-pandas-fab58e214d87

# df.loc[<linhas>, <colunas>]

In [103]:
df_8

    Name  Age       City    Country
a   jack   34     Sydeny  Australia
b   Riti   30      Delhi      India
c  Vikas   31     Mumbai      India
d  Neelu   32  Bangalore      India
e   John   16   New York         US
f   Mike   17  las vegas         US

In [112]:
df_8.loc[['a']]

   Name  Age    City    Country
a  jack   34  Sydeny  Australia

In [111]:
df_8.iloc[[0]]

   Name  Age    City    Country
a  jack   34  Sydeny  Australia

In [ ]:
# https://medium.com/horadecodar/data-science-tips-02-como-usar-loc-e-iloc-no-pandas-fab58e214d87

# ---------------------------------------------------------------------------------------------------------------

# REPLACING VALUES

In [ ]:
df.fillna(0, inplace=True)

# APPLYING FUNCTION

In [1]:
rectangles = [
    { 'height': 40, 'width': 10 },
    { 'height': 20, 'width': 9 },
    { 'height': 3.4, 'width': 4 }
]

In [2]:
rectangles

[{'height': 40, 'width': 10},
 {'height': 20, 'width': 9},
 {'height': 3.4, 'width': 4}]

In [5]:
rectangles_df = pd.DataFrame(rectangles)
rectangles_df

   height  width
0    40.0     10
1    20.0      9
2     3.4      4

In [6]:
def calculate_area(row):
    return row['height'] * row['width']

rectangles_df.apply(calculate_area, axis=1)

0    400.0
1    180.0
2     13.6
dtype: float64

In [7]:
# Use .apply to save the new column if we'd like
rectangles_df['area'] = rectangles_df.apply(calculate_area, axis=1)
rectangles_df

   height  width   area
0    40.0     10  400.0
1    20.0      9  180.0
2     3.4      4   13.6

# ---------------------------------------------------------------------------------------------------------------

# ERRORS

In [ ]:
df[df['Wage 10 elevado 6'] >= 30] 

'>=' not supported between instances of 'str' and 'int'

df[df['Wage 10 elevado 6'] >= '30']

In [ ]:
Strings em um DataFrame, mas dtype  objeto

In [ ]:
for c in df.columns:
    if df[c].dtype == object:
        print "convert ", df[c].name, " to string"
        df[c] = df[c].astype(str)
        
        
# para c em df.columns
# se df[c].type == object:
# df[c] = df[c].astype(str)

# TURNING INTO THE VARIABLES

In [ ]:
for c in df_1.columns:
    if df_1[c].dtype == object:
        print ("convert ", df_1[c].name, " to string")
        df[c] = df[c].astype(str)